ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульГенерацияКонтейнеров/вмс_СерверУправляемыйМодульГенерацияКонтейнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_СерверУправляемыйМодульГенерацияКонтейнеров</name>
  <attributes>
    <name>ПараметрыОбработки</name>
  </attributes>
  <attributes>
    <name>ДанныеОбработки</name>
  </attributes>
  <attributes>
    <name>СостояниеОбработки</name>
  </attributes>
  <attributes>
    <name>СтандартныйМодуль</name>
    <type>
      <types>DataProcessorObject.вмс_СерверУправляемыйМодульСтандартный</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/вмс_Контейнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Контейнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТипТары</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.вмс_ВидыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульГенерацияКонтейнеров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
Перем РК;

Функция ВыполнитьДействие(Действие) Экспорт
	
	Код = Действие.Код;
	
	Если Код="Инициализировать" Тогда
		
		ДействиеИнициализировать(Действие);
		
	ИначеЕсли Код="ИнициализироватьПоляОбработки" Тогда
		
		ДействиеИнициализироватьПоляОбработки(Действие);
		
	ИначеЕсли Код="ПослеЗаполненияДанныхПолей" Тогда
		
		ДействиеПослеЗаполненияДанныхПолей(Действие);
		
	КонецЕсли;
	
КонецФункции

Функция ДействиеИнициализировать(Действие)
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		//ТУ_Августинович ++ 06.05.2026
		// - Реализация записи документа основания и контрагента, если они есть (при генерации контейнеров через ТСД).
		
		НастройкаОператора = Неопределено;
		ДокументОснование  = Неопределено;
		Если ПараметрыОбработки.ИдентификаторРодителя <> 0 Тогда
			ПараметрыОбработкиРодителя = вмс_СерверУправляемыеОбработки.ПараметрыОбработки(ПараметрыОбработки.ИдентификаторРодителя);
			ПараметрыОбработкиРодителя.Свойство("НастройкаОператора", НастройкаОператора);
			ПараметрыОбработкиРодителя.Свойство("ДокументОснование",  ДокументОснование);
		КонецЕсли;
		
		ПараметрыОбработки.Вставить("НастройкаОператора", НастройкаОператора);
		ПараметрыОбработки.Вставить("ДокументОснование",  ДокументОснование);
		
		Попытка
			ПараметрыОбработки.Вставить("Контрагент", ДокументОснование.Контрагент);
		Исключение
			ПараметрыОбработки.Вставить("Контрагент", Неопределено);
		КонецПопытки;
		
		//ТУ_Августинович -- 06.05.2026
	КонецЕсли;
	
КонецФункции

Функция ДействиеИнициализироватьПоляОбработки(Действие)
	
	УстановитьСвойстваПолейОбработки("ТипКонтейнера", Новый Структура("Синоним, ТипЗначения, СписокВыбора", "Тип", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ТипыКонтейнеров"), СписокТиповКонтейнеров()));
	УстановитьСвойстваПолейОбработки("Количество", Новый Структура("Синоним, ТипЗначения", "Количество", Новый ОписаниеТипов("Число")));
	УстановитьСвойстваЭлементовВывода("Количество", Новый Структура("РастягиватьПоВертикали", Ложь));
	
	УстановитьПоляВводаОбработки("ТипКонтейнера, Количество");
	ДанныеОбработки.ВведенныеДанныеПолей.ТипКонтейнера = ПланыВидовХарактеристик.ТипыКонтейнеров.НайтиПоНаименованию("Коробка");
	ДанныеОбработки.ВведенныеДанныеПолей.Количество = 1;

	УстановитьПоляВыводаОбработки("ТипКонтейнера, Количество");
	СтандартныйМодуль.СгруппироватьЭлементыВывода("ТипКонтейнера, Количество");

	УстановитьТаблицуОбработки("ТаблицаКонтейнеров", "ПредставлениеКонтейнера, Контейнер", Истина, "ПредставлениеКонтейнера");
	УстановитьСвойстваЭлементовВывода("ТаблицаКонтейнеров", Новый Структура("ПоложениеКоманднойПанели", "Нет"));
	УстановитьСвойстваЭлементовВывода("ТаблицаКонтейнеровПредставлениеКонтейнера", Новый Структура("Заголовок", "Контейнеры"));

	УстановитьСвойстваЭлементовВывода("КнопкаПечать", Новый Структура("ТипЭлемента, Заголовок, Номер", "КнопкаФормы", "Печать", 2));
	УстановитьСвойстваЭлементовВывода("КнопкаСоздать", Новый Структура("ТипЭлемента, Заголовок, Номер", "КнопкаФормы", "Создать", 3));
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаПечать", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикКнопкиПечатьЭтикетокКонтейнеров")));
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаСоздать", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикКнопкиСоздатьКонтейнеры")));
	СтандартныйМодуль.СгруппироватьЭлементыВывода("КнопкаПечать, КнопкаСоздать");
	
	УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция ОбработчикКнопкиПечатьЭтикетокКонтейнеров(Результат, ДополнительныеПараметры) Экспорт
	
	Контейнеры = ДанныеОбработки.Таблицы.ТаблицаКонтейнеров.ВыгрузитьКолонку("Контейнер");
	Этикетка = вмс_Печать.СформироватьПечатнуюФормуКонтейнеров(Контейнеры);
	СтандартныйМодуль.НачатьПечать(Этикетка);
	
КонецФункции

Функция ОбработчикКнопкиСоздатьКонтейнеры(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеЗаполнения = Справочники.вмс_Контейнеры.НовыеПараметрыСозданияКонтейнеров();
	ДанныеЗаполнения.Количество = ДанныеОбработки.ВведенныеДанныеПолей.Количество;
	ДанныеЗаполнения.ТипКонтейнера = ДанныеОбработки.ВведенныеДанныеПолей.ТипКонтейнера;
	
	//ТУ_Августинович ++ 06.05.2026
	// - Реализация записи документа основания и контрагента, если они есть (при генерации контейнеров через ТСД).
	
	ДанныеЗаполнения.Контрагент	  = ПараметрыОбработки.Контрагент;
	ДанныеЗаполнения.Распоряжение = ПараметрыОбработки.ДокументОснование;
	
	//ДанныеЗаполнения.Контрагент = Контрагент;
	//Попытка
	//	//ДанныеЗаполнения.Распоряжение = КонтекстФормы.ДокументОснование;
	//Исключение
	//КонецПопытки;
	
	//ТУ_Августинович -- 06.05.2026
		
	МассивКонтейнеров = Справочники.вмс_Контейнеры.СоздатьКонтейнеры(ДанныеЗаполнения);
	ТаблицаКонтейнеров = ДанныеОбработки.Таблицы.ТаблицаКонтейнеров;
	Для Каждого Контейнер Из МассивКонтейнеров Цикл
		ЭлементКонтейнера = ТаблицаКонтейнеров.Добавить();
		ЭлементКонтейнера.Контейнер = Контейнер;
		ЭлементКонтейнера.ПредставлениеКонтейнера = "" + ТаблицаКонтейнеров.Количество() + ". " + Контейнер;
	КонецЦикла;
	
	ДанныеОбработки.ВведенныеДанныеПолей.Количество = 0;
	
	ЗаполнитьДанныеПолей();
	
КонецФункции

Функция ДействиеПослеЗаполненияДанныхПолей(Действие)
	
	ОбновитьЭлементыВывода();
	
КонецФункции

Функция ОбновитьЭлементыВывода()
	ВведенныеДанныеПолей = ДанныеОбработки.ВведенныеДанныеПолей;
	ДоступностьКнопкиСоздать = ЗначениеЗаполнено(ВведенныеДанныеПолей.ТипКонтейнера) И ЗначениеЗаполнено(ВведенныеДанныеПолей.Количество);
	УстановитьСвойстваЭлементовВывода("КнопкаСоздать", Новый Структура("Доступность", ДоступностьКнопкиСоздать));

	ДоступностьКнопкиПечать = ДанныеОбработки.Таблицы.ТаблицаКонтейнеров.Количество() > 0;
	УстановитьСвойстваЭлементовВывода("КнопкаПечать", Новый Структура("Доступность", ДоступностьКнопкиПечать));
КонецФункции

Функция СписокТиповКонтейнеров()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыКонтейнеров.Ссылка КАК Ссылка,
	|	ТипыКонтейнеров.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ТипыКонтейнеров КАК ТипыКонтейнеров
	|ГДЕ
	|	НЕ ТипыКонтейнеров.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокТиповКонтейнеров = Новый СписокЗначений;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокТиповКонтейнеров.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокТиповКонтейнеров;
	
КонецФункции











#Область ОбъявленияФункций
Функция ОткрытьФормуОбработки(ИмяФормы)

	ДобавитьДействиеНаКлиенте("ОткрытьФормуОбработки", Новый Структура("ИмяФормы", ИмяФормы));
	
КонецФункции

Функция УстановитьЗаголовокФормы(Заголовок)

	Возврат ДобавитьДействиеНаКлиенте("УстановитьЗаголовок", Заголовок);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место=Неопределено, Параметр=Неопределено, Имя=Неопределено)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ДобавитьЭтапВводаДанных", Новый Структура("ОписаниеОбработчика, Группа, Место, Параметр, Имя", ОписаниеОбработчика, Группа, Место, Параметр, Имя)));
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено)
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок);
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействие, знач ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействие, ПараметрыДействия);

КонецФункции

Функция ДействиеВыполняетсяПосле(Действие) Экспорт
	
	Возврат вмс_СерверУправляемыеОбработки.ДействиеВыполняетсяПосле(Действие);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

Функция ЗаполнитьДанныеПолей(СборщикиДанных=Неопределено)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаполнитьДанныеПолей", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);

КонецФункции

Функция ПолеОбработки(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(Поля=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПоляОбработки(ПараметрыОбработки, Поля);

КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьПоляВводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(Поле, Значение) Экспорт
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВывода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ТаблицаПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////

Функция ПараметрыТаблицы(ИмяТаблицы)
	
	Возврат СтандартныйМодуль.ПараметрыТаблицы(ИмяТаблицы);
	
КонецФункции

Функция УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость=Истина, знач ПоляВывода=Неопределено) Экспорт
	
	Возврат СтандартныйМодуль.УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость, ПоляВывода);
	
КонецФункции

Функция ПолучитьЭлементВывода(Имя)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВывода(Имя);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция УстановитьОбработчикиСобытийПолейОбработки(Поля=Неопределено, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки(Поля, События);
	
КонецФункции

Функция УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События) Экспорт
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События);

КонецФункции

Функция УстановитьПоляВыводаТаблицы(ИмяТаблицы, ПоляВывода)
	
	Возврат СтандартныйМодуль.УстановитьПоляВыводаТаблицы(ИмяТаблицы, ПоляВывода);
	
КонецФункции

#КонецОбласти

РК = вмс_РаботаСКоллекциями;
	
	
#КонецЕсли
